Lzw655/esp-bsp/bsp/esp32_p4_function_ev_board/src/mipi_soc/include/lp_sys_struct.h
/*
 * SPDX-FileCopyrightText: 2017-2023 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */
#ifndef _SOC_LP_SYS_STRUCT_H_
#define _SOC_LP_SYS_STRUCT_H_


#ifdef __cplusplus
extern "C" {
#endif

typedef volatile struct {
    uint32_t reserved_0;
    uint32_t reserved_4;
    uint32_t reserved_8;
    uint32_t reserved_c;
    uint32_t reserved_10;
    uint32_t reserved_14;
    uint32_t reserved_18;
    uint32_t reserved_1c;
    uint32_t ver_date;
    union {
        struct {
            uint32_t sosc_clk_div                  :    8;  /*100K RC oscillator clock divider number*/
            uint32_t sosc_clk_div_vld              :    1;  /*100K RC oscillator clock divider number update value bit*/
            uint32_t reserved9                     :    23;
        };
        uint32_t val;
    } slow_osc_ctrl;
    union {
        struct {
            uint32_t fosc_div_num                  :    3;  /*20M RC oscillator clock divider number update value bit*/
            uint32_t reserved3                     :    5;
            uint32_t fosc_div_vld                  :    1;  /*20M RC oscillator clock divider number update value bit*/
            uint32_t fosc_clk_force_on             :    1;  /*20M RC oscillator clock gating cell force open bit*/
            uint32_t reserved10                    :    22;
        };
        uint32_t val;
    } fast_osc_ctrl;
    union {
        struct {
            uint32_t slow_clk_src_sel              :    2;  /*LP system slow clock source select:
2'b10: 20M RC oscillator divide 256
2'b01: 32K XTAL
2'b00: 100K RC oscillator divided clock*/
            uint32_t reserved2                     :    6;
            uint32_t fast_clk_src_sel              :    1;  /*LP system fast clock source select:
1'b1:20M RC oscillator
1'b0:40M XTAL divide 2*/
            uint32_t reserved9                     :    7;
            uint32_t ena_sw_sel_sys_clk            :    1;  /*Enable Software to select lp_sys_clk source:
1'b0: lp_sys_clk source is selected by HW, this is the default setting
1'b1: lp_sys_clk source is selected by software*/
            uint32_t sw_sys_clk_src_sel            :    1;  /*lp_sys_clk source selection by software:
1'b0: LP system slow clock
1'b1: LP system fast clock*/
            uint32_t reserved18                    :    14;
        };
        uint32_t val;
    } clk_sel_ctrl;
    union {
        struct {
            uint32_t hp_xtal_force_on              :    1;  /*40M XTAL clock gating cell force open bit*/
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } lp_xtal_ctrl;
    union {
        struct {
            uint32_t slp_req                       :    1;  /*sleep request*/
            uint32_t slp_mode                      :    2;  /*identify sleep mode of the next coming sleep request:
2'b00: HP light sleep
2'b01: HP deep sleep
2'b10: LP light sleep
2'b11: LP deep sleep*/
            uint32_t glitch_rst_en                 :    1;  /*glitch reset enable*/
            uint32_t sys_sw_rst                    :    1;  /*digital system software reset bit*/
            uint32_t force_download_boot           :    1;
            uint32_t lp_fib_sel                    :    3;
            uint32_t pmu_main_st                   :    6;  /*PMU main status*/
            uint32_t io_mux_reset_disable          :    1;  /*reset disable bit for LP IOMUX*/
            uint32_t swd_bypass_rst                :    1;  /*SUPER WATCH dog reset bypass*/
            uint32_t efuse_relaod_after_reset      :    1;  /*Auto update contents in otp to memory and ctrl signals after reset*/
            uint32_t lightslp_keep_xtal_on         :    1;  /*Keep XTAL on under LP lightsleep mode*/
            uint32_t deepslp_keep_xtal_on          :    1;  /*Keep XTAL on under LP deepsleep mode*/
            uint32_t lightslp_keep_fosc_on         :    1;  /*Keep fast oscillator on under LP lightsleep mode*/
            uint32_t deepslp_keep_fosc_on          :    1;  /*Keep fast oscillator on under LP deepsleep mode*/
            uint32_t reserved22                    :    2;
            uint32_t lp_deepslp_dcdc_ls            :    1;  /*DCDC off & DCM enter lightsleep under LP deepsleep mode*/
            uint32_t lp_deepslp_dcdc_ds            :    1;  /*DCDC off & DCM enter deepsleep under LP deepsleep mode*/
            uint32_t lp_lightslp_dcdc_ls           :    1;  /*DCDC off & DCM enter lightsleep under LP lightsleep mode*/
            uint32_t lp_lightslp_dcdc_ds           :    1;  /*DCDC off & DCM enter deepsleep under LP lightsleep mode*/
            uint32_t reserved28                    :    4;
        };
        uint32_t val;
    } sys_ctrl;
    union {
        struct {
            uint32_t clk_en                        :    1;
            uint32_t lp_intr_clk_en                :    1;  /*clock enable of LP INTC*/
            uint32_t lp_mb_clk_en                  :    1;  /*clock enable of LP mailbox*/
            uint32_t lp_efuse_clk_en               :    1;  /*clock enable of LP EFUSE*/
            uint32_t lp_touch_clk_en               :    1;  /*clock enable of LP touch*/
            uint32_t lp_wdt_clk_en                 :    1;  /*clock enable of LP watchdog*/
            uint32_t lp_rtc_clk_en                 :    1;  /*clock enable of LP TIMER*/
            uint32_t lp_uart_clk_en                :    1;  /*clock enable of LP UART*/
            uint32_t lp_i2s_clk_en                 :    1;  /*clock enable of LP I2S*/
            uint32_t lp_spi_clk_en                 :    1;  /*clock enable of LP SPI*/
            uint32_t lp_adc_clk_en                 :    1;  /*clock enable of LP ADC*/
            uint32_t lp_dac_clk_en                 :    1;  /*clock enable of LP DAC*/
            uint32_t lp_ts_clk_en                  :    1;  /*clock enable of LP temp sensor*/
            uint32_t lp_i2c_clk_en                 :    1;  /*clock enable of LP I2C*/
            uint32_t lp_fosc_hp_clk_en             :    1;  /*clock enable of 20M RC clock from LP to HP*/
            uint32_t lp_fosc_d256_hp_clk_en        :    1;  /*clock enable of 20M RC divided clock from LP to HP*/
            uint32_t lp_xtal_hp_clk_en             :    1;  /*clock enable of XTAL clock from LP to HP*/
            uint32_t xtal32k_gpio_sel              :    1;  /*clock source select for 32K xtal*/
            uint32_t stimer_clk_en                 :    1;  /*clock enable for STIMER*/
            uint32_t stimer_core_clk_sel           :    1;  /*clock select for STIMER core clock*/
            uint32_t lp_i3c_slv_clk_en             :    1;  /*clock enable for i3c slave clock */
            uint32_t lp_i3c_mst_clk_en             :    1;  /*clock enable for i3c master clock */
            uint32_t reserved22                    :    10;
        };
        uint32_t val;
    } lp_clk_ctrl;
    union {
        struct {
            uint32_t lp_intr_rstn                  :    1;  /*LP INTC reset*/
            uint32_t lp_mb_rstn                    :    1;  /*LP mailbox reset*/
            uint32_t lp_touch_rstn                 :    1;  /*LP touch reset*/
            uint32_t lp_wdt_rstn                   :    1;  /*LP watchdog reset*/
            uint32_t lp_rtc_rstn                   :    1;  /*LP TIMER reset*/
            uint32_t lp_uart_rstn                  :    1;  /*LP UART reset*/
            uint32_t lp_i2s_rstn                   :    1;  /*LP I2S reset*/
            uint32_t lp_spi_rstn                   :    1;  /*LP SPI reset*/
            uint32_t lp_adc_rstn                   :    1;  /*LP ADC reset*/
            uint32_t lp_dac_rstn                   :    1;  /*LP DAC reset*/
            uint32_t lp_ts_rstn                    :    1;  /*LP temp sensor reset*/
            uint32_t lp_i2c_rstn                   :    1;  /*LP I2C reset*/
            uint32_t lp_cpu_rstn                   :    1;  /*LP CPU core reset*/
            uint32_t lp_tcm_rstn                   :    1;  /*LP TCM reset*/
            uint32_t stimer_rstn                   :    1;  /*Stimer reset*/
            uint32_t i2c_mst_rstn                  :    1;  /*Stimer reset*/
            uint32_t ana_rst_bypass                :    1;  /*analog source reset bypass : wdt,brown out,super wdt,glitch*/
            uint32_t sys_rst_bypass                :    1;  /*system source reset bypass : software reset,hp wdt,lp wdt,efuse*/
            uint32_t lp_i3c_slv_rstn               :    1;  /*i3c slave reset */
            uint32_t lp_i3c_mst_rstn               :    1;  /*i3c master reset*/
            uint32_t lp_icm_rstn                   :    1;  /*Lp icm reset*/
            uint32_t efuse_force_norst             :    1;  /*efuse force no reset control*/
            uint32_t reserved22                    :    10;
        };
        uint32_t val;
    } lp_rst_ctrl;
    union {
        struct {
            uint32_t hpcore0_sw_rst                :    1;  /*hp core0 SW reset*/
            uint32_t lp_wdt_hpcore0_rst_en         :    1;
            uint32_t lp_wdt_hpcore0_rst_len        :    3;
            uint32_t hpcore0_stall_wait_num        :    5;
            uint32_t hpcore0_stall_en              :    1;
            uint32_t hpcore0_stat_vector_sel       :    1;  /*1'b1: boot from HP TCM ROM: 0x30000400
1'b0: boot from LP TCM RAM:  0x50088400*/
            uint32_t reserved12                    :    20;
        };
        uint32_t val;
    } hp_core0_rst_ctrl;
    union {
        struct {
            uint32_t hpcore1_sw_rst                :    1;  /*hp core1 SW reset*/
            uint32_t lp_wdt_hpcore1_rst_en         :    1;
            uint32_t lp_wdt_hpcore1_rst_len        :    3;
            uint32_t hpcore1_stall_wait_num        :    5;
            uint32_t hpcore1_stall_en              :    1;
            uint32_t hpcore1_stat_vector_sel       :    1;  /*1'b1: boot from HP TCM ROM: 0x30000400
1'b0: boot from LP TCM RAM:  0x50088400*/
            uint32_t reserved12                    :    20;
        };
        uint32_t val;
    } hp_core1_rst_ctrl;
    union {
        struct {
            uint32_t hpcore2_sw_rst                :    1;  /*hp core2 SW reset*/
            uint32_t lp_wdt_hpcore2_rst_en         :    1;
            uint32_t lp_wdt_hpcore2_rst_len        :    3;
            uint32_t hpcore2_stall_wait_num        :    5;
            uint32_t hpcore2_stall_en              :    1;
            uint32_t hpcore2_stat_vector_sel       :    1;  /*1'b1: boot from HP TCM ROM: 0x30000400
1'b0: boot from LP TCM RAM:  0x50088400*/
            uint32_t reserved12                    :    20;
        };
        uint32_t val;
    } hp_core2_rst_ctrl;
    union {
        struct {
            uint32_t hpcore3_sw_rst                :    1;  /*hp core3 SW reset*/
            uint32_t lp_wdt_hpcore3_rst_en         :    1;
            uint32_t lp_wdt_hpcore3_rst_len        :    3;
            uint32_t hpcore3_stall_wait_num        :    5;
            uint32_t hpcore3_stall_en              :    1;
            uint32_t hpcore3_stat_vector_sel       :    1;  /*1'b1: boot from HP TCM ROM: 0x30000400
1'b0: boot from LP TCM RAM:  0x50088400*/
            uint32_t reserved12                    :    20;
        };
        uint32_t val;
    } hp_core3_rst_ctrl;
    union {
        struct {
            uint32_t hpcore0_sw_stall_code         :    8;  /*HP core0 software stall when set to 8'h86*/
            uint32_t hpcore1_sw_stall_code         :    8;  /*HP core1 software stall when set to 8'h86*/
            uint32_t hpcore2_sw_stall_code         :    8;  /*HP core2 software stall when set to 8'h86*/
            uint32_t hpcore3_sw_stall_code         :    8;  /*HP core3 software stall when set to 8'h86*/
        };
        uint32_t val;
    } hp_stall_ctrl;
    union {
        struct {
            uint32_t hpcore3_reset_cause           :    6;  /*6'h1: POR reset
6'h2: external reset
6'h3: digital system software reset
6'h5: PMU HP system power down reset
6'h6: PMU HP CPU power down reset
6'h7: HP system reset from HP watchdog
6'h9: HP system reset from LP watchdog
6'hb: HP core reset from HP watchdog
6'hc: HP core software reset
6'hd: HP core reset from LP watchdog
6'hf: brown out reset
6'h10: LP watchdog chip reset
6'h12: super watch dog reset
6'h13: glitch reset
6'h14: efuse crc error reset
6'h15: HP sdio chip reset
6'h16: HP usb jtag chip reset
6'h17: HP usb uart chip reset*/
            uint32_t hpcore3_reset_flag            :    1;
            uint32_t hpcore3_reset_flag_clr        :    1;
            uint32_t hpcore2_reset_cause           :    6;  /*6'h1: POR reset
6'h2: external reset
6'h3: digital system software reset
6'h5: PMU HP system power down reset
6'h6: PMU HP CPU power down reset
6'h7: HP system reset from HP watchdog
6'h9: HP system reset from LP watchdog
6'hb: HP core reset from HP watchdog
6'hc: HP core software reset
6'hd: HP core reset from LP watchdog
6'hf: brown out reset
6'h10: LP watchdog chip reset
6'h12: super watch dog reset
6'h13: glitch reset
6'h14: efuse crc error reset
6'h15: HP sdio chip reset
6'h16: HP usb jtag chip reset
6'h17: HP usb uart chip reset*/
            uint32_t hpcore2_reset_flag            :    1;
            uint32_t hpcore2_reset_flag_clr        :    1;
            uint32_t hpcore1_reset_cause           :    6;  /*6'h1: POR reset
6'h2: external reset
6'h3: digital system software reset
6'h5: PMU HP system power down reset
6'h6: PMU HP CPU power down reset
6'h7: HP system reset from HP watchdog
6'h9: HP system reset from LP watchdog
6'hb: HP core reset from HP watchdog
6'hc: HP core software reset
6'hd: HP core reset from LP watchdog
6'hf: brown out reset
6'h10: LP watchdog chip reset
6'h12: super watch dog reset
6'h13: glitch reset
6'h14: efuse crc error reset
6'h15: HP sdio chip reset
6'h16: HP usb jtag chip reset
6'h17: HP usb uart chip reset*/
            uint32_t hpcore1_reset_flag            :    1;
            uint32_t hpcore1_reset_flag_clr        :    1;
            uint32_t hpcore0_reset_cause           :    6;  /*6'h1: POR reset
6'h2: external reset
6'h3: digital system software reset
6'h5: PMU HP system power down reset
6'h6: PMU HP CPU power down reset
6'h7: HP system reset from HP watchdog
6'h9: HP system reset from LP watchdog
6'hb: HP core reset from HP watchdog
6'hc: HP core software reset
6'hd: HP core reset from LP watchdog
6'hf: brown out reset
6'h10: LP watchdog chip reset
6'h12: super watch dog reset
6'h13: glitch reset
6'h14: efuse crc error reset
6'h15: HP sdio chip reset
6'h16: HP usb jtag chip reset
6'h17: HP usb uart chip reset*/
            uint32_t hpcore0_reset_flag            :    1;
            uint32_t hpcore0_reset_flag_clr        :    1;
        };
        uint32_t val;
    } hp_core_rst_status;
    union {
        struct {
            uint32_t hp_wakeup_src_en              :    9;  /*Bit[0]: hp uart0 wakeup enable
Bit[1]: hp uart1 wakeup enable
Bit[2]: hp uart2 wakeup enable
Bit[3]: hp uart3 wakeup enable
Bit[4]: hp uart4 wakeup enable
Bit[5]: usb wakeup enable
Bit[6]: hp gpio wakeup enable
Bit[7]: hp software wakeup enable
Bit[8]: sdio slave wakeup enable*/
            uint32_t reserved9                     :    3;
            uint32_t hp_wakeup_cause               :    9;  /*Bit[0]: hp uart0 wakeup
Bit[1]: hp uart1 wakeup
Bit[2]: hp uart2 wakeup
Bit[3]: hp uart3 wakeup
Bit[4]: hp uart4 wakeup
Bit[5]: usb wakeup
Bit[6]: hp gpio wakeup
Bit[7]: hp software wakeup
Bit[8]: sdio slave wakeup*/
            uint32_t reserved21                    :    3;
            uint32_t hp_wakeup_cause_clr           :    1;  /*HP wakeup cause clear*/
            uint32_t hp_lp_wakeup                  :    1;  /*HP software wakeup*/
            uint32_t gpio_wakeup_filter            :    1;
            uint32_t ext_wakeup0_lv                :    1;
            uint32_t ext_wakeup1_lv                :    1;
            uint32_t reserved29                    :    3;
        };
        uint32_t val;
    } hp_wakeup_ctrl;
    union {
        struct {
            uint32_t lp_wakeup_src_en              :    15;  /*Bit[14]: monitor_timer3_wakeup enable
Bit[13]: monitor_timer2_wakeup enable
Bit[12]: monitor_timer1_wakeup enable
Bit[11]: monitor_timer0_wakeup enable
Bit[10]: lp gpio wakeup enable
Bit[9]: lp_uart_wakeup enable
Bit[8]: lp_tsens_wakeup enable
Bit[7]: lp_spi_wakeup enable
Bit[6]: lp_i2s_wakeup enable
Bit[5]: lp_i2c_wakeup enable
Bit[4]: lp_adc_wakeup enable
Bit[3]: lp_touch_wakeup enable
Bit[2]: lp_tmr_wakeup enable
Bit[1]: lp_ext1_wakeup enable
Bit[0]: lp_ext0_wakeup enable*/
            uint32_t reserved15                    :    1;
            uint32_t lp_wakeup_cause               :    15;  /*Bit[30]: monitor_timer3_wakeup
Bit[29]: monitor_timer2_wakeup
Bit[28]: monitor_timer1_wakeup
Bit[27]: monitor_timer0_wakeup
Bit[26]: lp gpio wakeup
Bit[25]: lp_uart_wakeup
Bit[24]: lp_tsens_wakeup
Bit[23]: lp_spi_wakeup
Bit[22]: lp_i2s_wakeup
Bit[21]: lp_i2c_wakeup
Bit[20]: lp_adc_wakeup
Bit[19]: lp_touch_wakeup
Bit[18]: lp_tmr_wakeup
Bit[17]: lp_ext1_wakeup
Bit[16]: lp_ext0_wakeup*/
            uint32_t lp_wakeup_cause_clr           :    1;
        };
        uint32_t val;
    } lp_wakeup_ctrl;
    union {
        struct {
            uint32_t hp_lightslp_reject_en         :    1;
            uint32_t hp_deepslp_reject_en          :    1;
            uint32_t hp_sleep_reject_src_en        :    9;  /*Bit[0]: hp uart0 wakeup active reject enable
Bit[1]: hp uart1 wakeup active reject enable
Bit[2]: hp uart2 wakeup active reject enable
Bit[3]: hp uart3 wakeup active reject enable
Bit[4]: hp uart4 wakeup active reject enable
Bit[5]: hp usb wakeup active reject enable
Bit[6]: hp gpio wakeup active reject enable
Bit[7]: hp software wakeup active reject enable
Bit[8]: hp sdio slave wakeup active reject enable*/
            uint32_t reserved11                    :    5;
            uint32_t hp_slp_reject_cause           :    9;  /*Bit[0]: hp uart0 wakeup active
Bit[1]: hp uart1 wakeup active
Bit[2]: hp uart2 wakeup active
Bit[3]: hp uart3 wakeup active
Bit[4]: hp uart4 wakeup active
Bit[5]: hp usb wakeup active
Bit[6]: hp gpio wakeup active
Bit[7]: hp software wakeup active
Bit[8]: hp sdio slave wakeup active*/
            uint32_t reserved25                    :    6;
            uint32_t hp_slp_reject_cause_clr       :    1;
        };
        uint32_t val;
    } hp_sleep_rej_ctrl;
    union {
        struct {
            uint32_t lp_lightslp_reject_en         :    1;
            uint32_t lp_deepslp_reject_en          :    1;
            uint32_t lp_sleep_reject_src_en        :    11;  /*Bit[10]: lp_gpio_wakeup active reject enable
Bit[9]: lp_uart_wakeup active reject enable
Bit[8]: lp_tsens_wakeup active reject enable
Bit[7]: lp_spi_wakeup active reject enable
Bit[6]: lp_i2s_wakeup active reject enable
Bit[5]: lp_i2c_wakeup active reject enable
Bit[4]: lp_adc_wakeup active reject enable
Bit[3]: lp_touch_wakeup active reject enable
Bit[2]: lp_tmr_wakeup active reject enable
Bit[1]: lp_ext1_wakeup active reject enable
Bit[0]: lp_ext0_wakeup active reject enable*/
            uint32_t lp_slp_reject_cause           :    11;  /*Bit[10]: lp_gpio_wakeup active
Bit[9]: lp_uart_wakeup active
Bit[8]: lp_tsens_wakeup active
Bit[7]: lp_spi_wakeup active
Bit[6]: lp_i2s_wakeup active
Bit[5]: lp_i2c_wakeup active
Bit[4]: lp_adc_wakeup active
Bit[3]: lp_touch_wakeup active
Bit[2]: lp_tmr_wakeup active
Bit[1]: lp_ext1_wakeup active
Bit[0]: lp_ext0_wakeup active*/
            uint32_t lp_slp_reject_cause_clr       :    1;
            uint32_t reserved25                    :    7;
        };
        uint32_t val;
    } lp_sleep_rej_ctrl;
    union {
        struct {
            uint32_t ana_dig_force_iso             :    1;
            uint32_t ana_dig_force_noiso           :    1;
            uint32_t reserved2                     :    30;
        };
        uint32_t val;
    } ana_i2c_iso_ctrl;
    union {
        struct {
            uint32_t apll_cal_slp_start            :    1;
            uint32_t apll_force_pd                 :    1;
            uint32_t apll_force_pu                 :    1;
            uint32_t reserved3                     :    29;
        };
        uint32_t val;
    } apll_pwr_ctrl;
    union {
        struct {
            uint32_t bias_buf_deepslp_xpd          :    1;
            uint32_t bias_buf_idle_xpd             :    1;
            uint32_t bias_buf_monitor_xpd          :    1;
            uint32_t bias_buf_wait_xtal_xpd        :    1;
            uint32_t bias_deepslp                  :    1;
            uint32_t bias_monitor                  :    1;
            uint32_t dbg_atten_deepslp             :    4;
            uint32_t dbg_atten_monitor             :    4;
            uint32_t pd_cur_deepslp                :    1;
            uint32_t pd_cur_monitor                :    1;
            uint32_t reserved16                    :    16;
        };
        uint32_t val;
    } bias_pwr_ctrl;
    union {
        struct {
            uint32_t fosc_div_enb                  :    1;
            uint32_t fosc_div                      :    2;
            uint32_t fosc_dfreq                    :    10;
            uint32_t fosc_enb                      :    1;
            uint32_t fosc_force_pd                 :    1;
            uint32_t fosc_force_pu                 :    1;
            uint32_t reserved16                    :    16;
        };
        uint32_t val;
    } fast_rc_pwr_ctrl;
    union {
        struct {
            uint32_t hp_cpu_force_iso              :    1;  /*hp cpu power domain isolation force on*/
            uint32_t hp_cpu_force_noiso            :    1;  /*hp cpu power domain isolation force off*/
            uint32_t hp_cpu_force_pd               :    1;  /*hp cpu power domain force power off*/
            uint32_t hp_cpu_force_pu               :    1;  /*hp cpu power domain force power on*/
            uint32_t hp_cpu_pd_en                  :    1;  /*hp cpu power domain power down enable*/
            uint32_t hp_cpu_stall_wait_num         :    10;  /*hp cpu stall wait cycle num when light sleep*/
            uint32_t reserved15                    :    17;
        };
        uint32_t val;
    } hp_cpu_pwr_ctrl;
    union {
        struct {
            uint32_t hp_pad_force_unhold           :    1;  /*hp pad hold force off*/
            uint32_t hp_pad_force_hold             :    1;  /*hp pad hold force on*/
            uint32_t hp_pad_autohold_en            :    1;  /*hp pad auto-hold enable*/
            uint32_t clr_hp_pad_autohold           :    1;  /*hp pad autohold clear*/
            uint32_t hp_pad_force_noiso            :    1;  /*hp pad isolation force off*/
            uint32_t hp_pad_force_iso              :    1;  /*hp pad isolation force on*/
            uint32_t reserved6                     :    26;
        };
        uint32_t val;
    } hp_pad_pwr_ctrl;
    union {
        struct {
            uint32_t hp_peri_force_iso             :    1;  /*hp peripheral power domain isolation force on*/
            uint32_t hp_peri_force_noiso           :    1;  /*hp peripheral power domain isolation force off*/
            uint32_t hp_peri_force_pd              :    1;  /*hp peripheral power domain force power off*/
            uint32_t hp_peri_force_pu              :    1;  /*hp peripheral power domain force power on*/
            uint32_t hp_peri_pd_en                 :    1;  /*hp peripheral power domain power down enable*/
            uint32_t reserved5                     :    27;
        };
        uint32_t val;
    } hp_peri_pwr_ctrl;
    union {
        struct {
            uint32_t hp_top_force_iso              :    1;  /*hp top power domain isolation force off*/
            uint32_t hp_top_force_noiso            :    1;  /*hp top power domain isolation force off*/
            uint32_t hp_top_force_pd               :    1;  /*hp top power domain force power off*/
