Lzw655/esp-bsp/bsp/esp32_p4_function_ev_board/src/mipi_soc/include/lp_sys_struct.h
            uint32_t hp_top_force_pu               :    1;  /*hp top power domain force power on*/
            uint32_t hp_top_pd_en                  :    1;  /*hp top power domain power down enable*/
            uint32_t xtal_pd_en                    :    1;  /*HP XTAL power down enable*/
            uint32_t pll_pd_en                     :    1;  /*HP system PLL power down enable*/
            uint32_t hp_sleep_wait_num             :    10;  /*minimum sleep cycles for HP*/
            uint32_t ana_dig_en_cal                :    1;  /*for hp LDO*/
            uint32_t reserved18                    :    6;
            uint32_t hp_deepslp_dcdc_ls            :    1;  /*DCDC off & DCM enter lightsleep under HP deepsleep mode*/
            uint32_t hp_deepslp_dcdc_ds            :    1;  /*DCDC off & DCM enter deepsleep under HP deepsleep mode*/
            uint32_t hp_deepslp_dcdc_off           :    1;  /* both DCDC & DCM off under HP deepsleep mode*/
            uint32_t hp_lightslp_dcdc_ls           :    1;  /*DCDC off & DCM enter lightsleep under HP lightsleep mode*/
            uint32_t hp_lightslp_dcdc_ds           :    1;  /*DCDC off & DCM enter deepsleep under HP lightsleep mode*/
            uint32_t reserved29                    :    3;
        };
        uint32_t val;
    } hp_top_pwr_ctrl;
    union {
        struct {
            uint32_t hp_xtal_stable_wait_num       :    10;  /*wait cycle number for XTAL stable*/
            uint32_t hp_power_stable_wait_num      :    10;  /*wait cycle number for HP power stable*/
            uint32_t hp_pll_stable_wait_num        :    10;  /*wait cycle number for system PLL stable*/
            uint32_t reserved30                    :    2;
        };
        uint32_t val;
    } hp_wakeup_wait_num;
    union {
        struct {
            uint32_t lp_cpu_force_iso              :    1;  /*LP CPU power domain isolation force on*/
            uint32_t lp_cpu_force_noiso            :    1;  /*LP CPU power domain isolation force off*/
            uint32_t lp_cpu_force_pd               :    1;  /*LP CPU power domain force power down*/
            uint32_t lp_cpu_force_pu               :    1;  /*LP CPU power domain force power on*/
            uint32_t lp_cpu_pd_en                  :    1;  /*LP CPU power domain power down enable*/
            uint32_t lp_cpu_stall_wait_num         :    10;  /*stall cycle number for LP light sleep*/
            uint32_t lp_sleep_wait_num             :    10;  /*minimum sleep cycles for LP*/
            uint32_t lp_ldo_force_pu               :    1;  /*LP LDO power force power on*/
            uint32_t reserved26                    :    6;
        };
        uint32_t val;
    } lp_cpu_pwr_ctrl;
    union {
        struct {
            uint32_t lp_peri0_force_iso            :    1;  /*LP peripheral 0 power domain isolation force on*/
            uint32_t lp_peri0_force_noiso          :    1;  /*LP peripheral 0 power domain isolation force off*/
            uint32_t lp_peri0_force_pd             :    1;  /*LP peripheral 0 power domain force power off*/
            uint32_t lp_peri0_force_pu             :    1;  /*LP peripheral 0 power domain force power on*/
            uint32_t lp_peri0_pd_en                :    1;  /*LP peripheral 0 power domain power down enable*/
            uint32_t lp_pad_force_hold             :    1;
            uint32_t reserved6                     :    26;
        };
        uint32_t val;
    } lp_peri0_pwr_ctrl;
    union {
        struct {
            uint32_t lp_peri1_force_iso            :    1;  /*LP peripheral 1 power domain force isolation on*/
            uint32_t lp_peri1_force_noiso          :    1;  /*LP peripheral 1 power domain force isolation off*/
            uint32_t lp_peri1_force_pd             :    1;  /*LP peripheral 1 power domain force power off*/
            uint32_t lp_peri1_force_pu             :    1;  /*LP peripheral 1 power domain force power on*/
            uint32_t lp_peri1_pd_en                :    1;  /*LP peripheral 1 power domain power down enable*/
            uint32_t reserved5                     :    27;
        };
        uint32_t val;
    } lp_peri1_pwr_ctrl;
    union {
        struct {
            uint32_t lp_fosc_stable_wait_num       :    10;  /*wait cycle number for LP fast clock stable*/
            uint32_t lp_power_stable_wait_num      :    10;  /*wait cycle number for LP power stable*/
            uint32_t reserved20                    :    12;
        };
        uint32_t val;
    } lp_wakeup_wait_num;
    union {
        struct {
            uint32_t monitor_timer0_en             :    1;  /*monitor timer0 enable*/
            uint32_t monitor_timer1_en             :    1;  /*monitor timer1 enable*/
            uint32_t monitor_timer2_en             :    1;  /*monitor timer2 enable*/
            uint32_t monitor_timer3_en             :    1;  /*monitor timer3 enable*/
            uint32_t rtc_cali_en                   :    1;  /*calibration enable for RTC*/
            uint32_t monitor_timer0_work_done      :    1;  /*monitor work done, start next sleep cycle of timer0*/
            uint32_t monitor_timer1_work_done      :    1;  /*monitor work done, start next sleep cycle of timer1*/
            uint32_t monitor_timer2_work_done      :    1;  /*monitor work done, start next sleep cycle of timer2*/
            uint32_t monitor_timer3_work_done      :    1;  /*monitor work done, start next sleep cycle of timer3*/
            uint32_t reserved9                     :    7;
            uint32_t monitor_timer0_wakeup_int     :    1;  /*moniter timer0 wakeup interrupt*/
            uint32_t monitor_timer1_wakeup_int     :    1;  /*moniter timer1 wakeup interrupt*/
            uint32_t monitor_timer2_wakeup_int     :    1;  /*moniter timer2 wakeup interrupt */
            uint32_t monitor_timer3_wakeup_int     :    1;  /*moniter timer3 wakeup interrupt*/
            uint32_t reserved20                    :    4;
            uint32_t monitor_timer0_int_clr        :    1;  /*write 1 to clear monitor timer3 wakeup interrupt*/
            uint32_t monitor_timer1_int_clr        :    1;  /*write 1 to clear monitor timer2 wakeup interrupt*/
            uint32_t monitor_timer2_int_clr        :    1;  /*write 1 to clear monitor timer1 wakeup interrupt*/
            uint32_t monitor_timer3_int_clr        :    1;  /*write 1 to clear monitor timer0 wakeup interrupt*/
            uint32_t reserved28                    :    4;
        };
        uint32_t val;
    } moni_timer_ctrl;
    uint32_t moni_timer0_slp_wait_num;
    uint32_t moni_timer1_slp_wait_num;
    uint32_t moni_timer2_slp_wait_num;
    uint32_t moni_timer3_slp_wait_num;
    uint32_t rtc_cali_slp_wait_num;
    uint32_t reserved_b4;
    union {
        struct {
            uint32_t sleep_por_force_on            :    1;
            uint32_t sleep_por_force_off           :    1;
            uint32_t sar_i2c_xpd                   :    1;
            uint32_t reserved3                     :    29;
        };
        uint32_t val;
    } ana_i2c_pwr_ctrl;
    union {
        struct {
            uint32_t spll_cal_slp_start            :    1;
            uint32_t spll_force_pd                 :    1;
            uint32_t spll_force_pu                 :    1;
            uint32_t spll_i2c_force_pd             :    1;
            uint32_t spll_i2c_force_pu             :    1;
            uint32_t reserved5                     :    11;
            uint32_t cpll_cal_slp_start            :    1;
            uint32_t cpll_force_pd                 :    1;
            uint32_t cpll_force_pu                 :    1;
            uint32_t cpll_i2c_force_pd             :    1;
            uint32_t cpll_i2c_force_pu             :    1;
            uint32_t reserved21                    :    11;
        };
        uint32_t val;
    } spll_pwr_ctrl;
    union {
        struct {
            uint32_t xtal_32k_xpd                  :    1;
            uint32_t xtal_32k_force                :    1;
            uint32_t xtal_32k_dbuf                 :    1;
            uint32_t xtal_32k_dgm                  :    3;
            uint32_t xtal_32k_dres                 :    3;
            uint32_t xtal_32k_dac                  :    3;
            uint32_t rc32k_xpd                     :    1;
            uint32_t rc32k_dfreq                   :    10;
            uint32_t reserved23                    :    9;
        };
        uint32_t val;
    } slow_xtal_pwr_ctrl;
    union {
        struct {
            uint32_t xtal_force_pd                 :    1;
            uint32_t xtal_force_pu                 :    1;
            uint32_t xtal_ext_ctr_en               :    1;
            uint32_t xtal_ext_ctr_lv               :    1;
            uint32_t xtal_en_wait                  :    4;
            uint32_t xtal_fall_delay_num           :    10;
            uint32_t reserved18                    :    14;
        };
        uint32_t val;
    } xtal_pwr_ctrl;
    union {
        struct {
            uint32_t brown_out_ena                 :    1;
            uint32_t brown_out_cnt_clr             :    1;
            uint32_t brown_out_rst_ena             :    1;
            uint32_t brown_out_rst_sel             :    1;
            uint32_t brown_out_close_flash_ena     :    1;
            uint32_t brown_out_rst_wait_num        :    10;
            uint32_t brown_out_int_wait_num        :    10;
            uint32_t brown_out_ana_rst_en          :    1;
            uint32_t brown_out_det                 :    1;
            uint32_t reserved27                    :    5;
        };
        uint32_t val;
    } brown_out_ctrl;
    uint32_t lp_core_boot_addr;
    union {
        struct {
            uint32_t ext_wakeup1_sel               :    24;  /*Bitmap to select RTC pads for ext wakeup1*/
            uint32_t ext_wakeup1_status_clr        :    1;  /*clear ext wakeup1 status*/
            uint32_t reserved25                    :    7;
        };
        uint32_t val;
    } ext_wakeup1;
    union {
        struct {
            uint32_t ext_wakeup1_status            :    24;  /*ext wakeup1 status*/
            uint32_t reserved24                    :    8;
        };
        uint32_t val;
    } ext_wakeup1_status;
    union {
        struct {
            uint32_t deepslp_tcm_rom_sd            :    1;
            uint32_t deepslp_tcm_rom_ls            :    1;
            uint32_t deepslp_tcm_ram_sd            :    1;
            uint32_t deepslp_tcm_ram_ds            :    1;
            uint32_t deepslp_tcm_ram_ls            :    1;
            uint32_t lp_tcm_rom_clk_force_on       :    1;
            uint32_t reserved6                     :    1;
            uint32_t lp_tcm_ram_clk_force_on       :    1;
            uint32_t lightslp_tcm_rom_sd           :    1;
            uint32_t lightslp_tcm_rom_ls           :    1;
            uint32_t lightslp_tcm_ram_sd           :    1;
            uint32_t lightslp_tcm_ram_ds           :    1;
            uint32_t lightslp_tcm_ram_ls           :    1;
            uint32_t reserved13                    :    19;
        };
        uint32_t val;
    } lp_tcm_pwr_ctrl;
    uint32_t boot_addr_hp_lp;
    uint32_t lp_store0;
    uint32_t lp_store1;
    uint32_t lp_store2;
    uint32_t lp_store3;
    uint32_t lp_store4;
    uint32_t lp_store5;
    uint32_t lp_store6;
    uint32_t lp_store7;
    union {
        struct {
            uint32_t lp_slp_wakeup_int_ena         :    1;  /*enable sleep wakeup interrupt*/
            uint32_t lp_slp_reject_int_ena         :    1;  /*enable sleep reject interrupt*/
            uint32_t hp_slp_wakeup_int_ena         :    1;  /*enable sleep wakeup interrupt*/
            uint32_t hp_slp_reject_int_ena         :    1;  /*enable sleep reject interrupt*/
            uint32_t brown_out_int_ena             :    1;  /*enable brown out interrupt*/
            uint32_t glitch_det_int_ena            :    1;  /*enable glitch detect interrupt*/
            uint32_t ana_0p1a_cnt_target0_reach_0_int_ena:    1;  /*reg_0p1a_0_counter after xpd reach target0*/
            uint32_t ana_0p1a_cnt_target1_reach_0_int_ena:    1;  /*reg_0p1a_1_counter after xpd reach target1*/
            uint32_t ana_0p1a_cnt_target0_reach_1_int_ena:    1;  /*reg_0p1a_0 counter after xpd reach target0*/
            uint32_t ana_0p1a_cnt_target1_reach_1_int_ena:    1;  /*reg_0p1a_1_counter after xpd reach target1*/
            uint32_t ana_0p2a_cnt_target0_reach_0_int_ena:    1;  /*reg_0p2a_0 counter after xpd reach target0*/
            uint32_t ana_0p2a_cnt_target1_reach_0_int_ena:    1;  /*reg_0p2a_1_counter after xpd reach target1*/
            uint32_t ana_0p2a_cnt_target0_reach_1_int_ena:    1;  /*reg_0p2a_0 counter after xpd reach target0*/
            uint32_t ana_0p2a_cnt_target1_reach_1_int_ena:    1;  /*reg_0p2a_1_counter after xpd reach target1*/
            uint32_t ana_0p3a_cnt_target0_reach_0_int_ena:    1;  /*reg_0p3a_0 counter after xpd reach target0*/
            uint32_t ana_0p3a_cnt_target1_reach_0_int_ena:    1;  /*reg_0p3a_1_counter after xpd reach target1*/
            uint32_t ana_0p3a_cnt_target0_reach_1_int_ena:    1;  /*reg_0p3a_0_counter after xpd reach target0*/
            uint32_t ana_0p3a_cnt_target1_reach_1_int_ena:    1;  /*reg_0p3a_1_counter after xpd reach target1*/
            uint32_t reserved18                    :    14;
        };
        uint32_t val;
    } pmu_int_ena;
    union {
        struct {
            uint32_t lp_slp_wakeup_int_raw         :    1;  /*sleep wakeup interrupt raw*/
            uint32_t lp_slp_reject_int_raw         :    1;  /*sleep reject interrupt raw*/
            uint32_t hp_slp_wakeup_int_raw         :    1;  /*sleep wakeup interrupt raw*/
            uint32_t hp_slp_reject_int_raw         :    1;  /*sleep reject interrupt raw*/
            uint32_t brown_out_int_raw             :    1;  /*brown out interrupt raw*/
            uint32_t glitch_det_int_raw            :    1;  /*glitch detect interrupt raw*/
            uint32_t ana_0p1a_cnt_target0_reach_0_int_raw:    1;  /*reg_0p1a_0_counter after xpd reach target0*/
            uint32_t ana_0p1a_cnt_target1_reach_0_int_raw:    1;  /*reg_0p1a_1_counter after xpd reach target1*/
            uint32_t ana_0p1a_cnt_target0_reach_1_int_raw:    1;  /*reg_0p1a_0 counter after xpd reach target0*/
            uint32_t ana_0p1a_cnt_target1_reach_1_int_raw:    1;  /*reg_0p1a_1_counter after xpd reach target1*/
            uint32_t ana_0p2a_cnt_target0_reach_0_int_raw:    1;  /*reg_0p2a_0 counter after xpd reach target0*/
            uint32_t ana_0p2a_cnt_target1_reach_0_int_raw:    1;  /*reg_0p2a_1_counter after xpd reach target1*/
            uint32_t ana_0p2a_cnt_target0_reach_1_int_raw:    1;  /*reg_0p2a_0 counter after xpd reach target0*/
            uint32_t ana_0p2a_cnt_target1_reach_1_int_raw:    1;  /*reg_0p2a_1_counter after xpd reach target1*/
            uint32_t ana_0p3a_cnt_target0_reach_0_int_raw:    1;  /*reg_0p3a_0 counter after xpd reach target0*/
            uint32_t ana_0p3a_cnt_target1_reach_0_int_raw:    1;  /*reg_0p3a_1_counter after xpd reach target1*/
            uint32_t ana_0p3a_cnt_target0_reach_1_int_raw:    1;  /*reg_0p3a_0_counter after xpd reach target0*/
            uint32_t ana_0p3a_cnt_target1_reach_1_int_raw:    1;  /*reg_0p3a_1_counter after xpd reach target1*/
            uint32_t reserved18                    :    14;
        };
        uint32_t val;
    } pmu_int_raw;
    union {
        struct {
            uint32_t lp_slp_wakeup_int_st          :    1;  /*sleep wakeup interrupt state*/
            uint32_t lp_slp_reject_int_st          :    1;  /*sleep reject interrupt state*/
            uint32_t hp_slp_wakeup_int_st          :    1;  /*sleep wakeup interrupt state*/
            uint32_t hp_slp_reject_int_st          :    1;  /*sleep reject interrupt state*/
            uint32_t brown_out_int_st              :    1;  /*brown out interrupt state*/
            uint32_t glitch_det_int_st             :    1;  /*glitch detect interrupt state*/
            uint32_t ana_0p1a_cnt_target0_reach_0_int_st:    1;  /*reg_0p1a_0_counter after xpd reach target0*/
            uint32_t ana_0p1a_cnt_target1_reach_0_int_st:    1;  /*reg_0p1a_1_counter after xpd reach target1*/
            uint32_t ana_0p1a_cnt_target0_reach_1_int_st:    1;  /*reg_0p1a_0 counter after xpd reach target0*/
            uint32_t ana_0p1a_cnt_target1_reach_1_int_st:    1;  /*reg_0p1a_1_counter after xpd reach target1*/
            uint32_t ana_0p2a_cnt_target0_reach_0_int_st:    1;  /*reg_0p2a_0 counter after xpd reach target0*/
            uint32_t ana_0p2a_cnt_target1_reach_0_int_st:    1;  /*reg_0p2a_1_counter after xpd reach target1*/
            uint32_t ana_0p2a_cnt_target0_reach_1_int_st:    1;  /*reg_0p2a_0 counter after xpd reach target0*/
            uint32_t ana_0p2a_cnt_target1_reach_1_int_st:    1;  /*reg_0p2a_1_counter after xpd reach target1*/
            uint32_t ana_0p3a_cnt_target0_reach_0_int_st:    1;  /*reg_0p3a_0 counter after xpd reach target0*/
            uint32_t ana_0p3a_cnt_target1_reach_0_int_st:    1;  /*reg_0p3a_1_counter after xpd reach target1*/
            uint32_t ana_0p3a_cnt_target0_reach_1_int_st:    1;  /*reg_0p3a_0_counter after xpd reach target0*/
            uint32_t ana_0p3a_cnt_target1_reach_1_int_st:    1;  /*reg_0p3a_1_counter after xpd reach target1*/
            uint32_t reserved18                    :    14;
        };
        uint32_t val;
    } pmu_int_st;
    union {
        struct {
            uint32_t lp_slp_wakeup_int_clr         :    1;  /*Clear sleep wakeup interrupt state*/
            uint32_t lp_slp_reject_int_clr         :    1;  /*Clear sleep reject interrupt state*/
            uint32_t hp_slp_wakeup_int_clr         :    1;  /*Clear sleep wakeup interrupt state*/
            uint32_t hp_slp_reject_int_clr         :    1;  /*Clear sleep reject interrupt state*/
            uint32_t brown_out_int_clr             :    1;  /*CLear brown out interrupt state*/
            uint32_t glitch_det_int_clr            :    1;  /*CLear glitch det interrupt state*/
            uint32_t ana_0p1a_cnt_target0_reach_0_int_clr:    1;  /*reg_0p1a_0_counter after xpd reach target0*/
            uint32_t ana_0p1a_cnt_target1_reach_0_int_clr:    1;  /*reg_0p1a_1_counter after xpd reach target1*/
            uint32_t ana_0p1a_cnt_target0_reach_1_int_clr:    1;  /*reg_0p1a_0 counter after xpd reach target0*/
            uint32_t ana_0p1a_cnt_target1_reach_1_int_clr:    1;  /*reg_0p1a_1_counter after xpd reach target1*/
            uint32_t ana_0p2a_cnt_target0_reach_0_int_clr:    1;  /*reg_0p2a_0 counter after xpd reach target0*/
            uint32_t ana_0p2a_cnt_target1_reach_0_int_clr:    1;  /*reg_0p2a_1_counter after xpd reach target1*/
            uint32_t ana_0p2a_cnt_target0_reach_1_int_clr:    1;  /*reg_0p2a_0 counter after xpd reach target0*/
            uint32_t ana_0p2a_cnt_target1_reach_1_int_clr:    1;  /*reg_0p2a_1_counter after xpd reach target1*/
            uint32_t ana_0p3a_cnt_target0_reach_0_int_clr:    1;  /*reg_0p3a_0 counter after xpd reach target0*/
            uint32_t ana_0p3a_cnt_target1_reach_0_int_clr:    1;  /*reg_0p3a_1_counter after xpd reach target1*/
            uint32_t ana_0p3a_cnt_target0_reach_1_int_clr:    1;  /*reg_0p3a_0_counter after xpd reach target0*/
            uint32_t ana_0p3a_cnt_target1_reach_1_int_clr:    1;  /*reg_0p3a_1_counter after xpd reach target1*/
            uint32_t reserved18                    :    14;
        };
        uint32_t val;
    } pmu_int_clr;
    uint32_t reserved_110;
    uint32_t reserved_114;
    uint32_t reserved_118;
    uint32_t reserved_11c;
    union {
        struct {
            uint32_t probe_a_mod_sel               :    16;
            uint32_t probe_a_top_sel               :    8;
            uint32_t probe_l_sel                   :    2;
            uint32_t probe_h_sel                   :    2;
            uint32_t probe_global_en               :    1;
            uint32_t reserved29                    :    3;
        };
        uint32_t val;
    } lp_probea_ctrl;
    union {
        struct {
            uint32_t probe_b_mod_sel               :    16;
            uint32_t probe_b_top_sel               :    8;
            uint32_t probe_b_en                    :    1;
            uint32_t reserved25                    :    7;
        };
        uint32_t val;
    } lp_probeb_ctrl;
    uint32_t lp_probe_out;
    union {
        struct {
            uint32_t dbg_req                       :    1;
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } lp_core_dbg_req;
    uint32_t lp_core_dbg_dm_halt_addr;
    uint32_t lp_core_dbg_dm_exception_addr;
    uint32_t lp_core_dbg_x2;
    uint32_t lp_core_dbg_x10;
    uint32_t lp_core_dbg_x11;
    uint32_t lp_core_dbg_pc;
    uint32_t reserved_148;
    union {
        struct {
            uint32_t ana_hp_vss_drv_b_0            :    6;
            uint32_t ana_hp_vss_drv_b_1            :    6;
            uint32_t ana_hp_vss_drv_b_2            :    6;
            uint32_t ana_hp_vss_drv_b_3            :    6;
            uint32_t ana_hp_vss_drv_b_4            :    6;
            uint32_t reserved30                    :    2;
        };
        uint32_t val;
    } vss_ctrl0;
    union {
        struct {
            uint32_t ana_hp_vss_drv_b_5            :    6;
            uint32_t ana_lp_vss_drv_b              :    6;
            uint32_t reserved12                    :    20;
        };
        uint32_t val;
    } vss_ctrl1;
    union {
        struct {
            uint32_t ana_0p1a_xpd_0                :    1;
            uint32_t ana_0p1a_xpd_1                :    1;
            uint32_t ana_0p1a_mul_0                :    3;
            uint32_t ana_0p1a_mul_1                :    3;
            uint32_t ana_0p1a_en_vdet_0            :    1;
            uint32_t ana_0p1a_en_vdet_1            :    1;
            uint32_t ana_0p1a_en_cur_lim_0         :    1;
            uint32_t ana_0p1a_en_cur_lim_1         :    1;
            uint32_t ana_0p1a_tieh_sel_0           :    3;
            uint32_t ana_0p1a_tieh_sel_1           :    3;
            uint32_t ana_0p1a_tieh_0               :    1;
            uint32_t ana_0p1a_tieh_1               :    1;
            uint32_t force_ana_0p1a_tieh_sel_0     :    1;
            uint32_t force_ana_0p1a_tieh_sel_1     :    1;
            uint32_t ana_0p1a_dref_0               :    4;
            uint32_t ana_0p1a_dref_1               :    4;
            uint32_t reserved30                    :    2;
        };
        uint32_t val;
    } io_ldo_ctrl0;
    union {
        struct {
            uint32_t ana_0p2a_xpd_0                :    1;
            uint32_t ana_0p2a_xpd_1                :    1;
            uint32_t ana_0p2a_mul_0                :    3;
            uint32_t ana_0p2a_mul_1                :    3;
            uint32_t ana_0p2a_en_vdet_0            :    1;
            uint32_t ana_0p2a_en_vdet_1            :    1;
            uint32_t ana_0p2a_en_cur_lim_0         :    1;
            uint32_t ana_0p2a_en_cur_lim_1         :    1;
            uint32_t ana_0p2a_tieh_sel_0           :    3;
            uint32_t ana_0p2a_tieh_sel_1           :    3;
            uint32_t ana_0p2a_tieh_0               :    1;
            uint32_t ana_0p2a_tieh_1               :    1;
            uint32_t force_ana_0p2a_tieh_sel_0     :    1;
            uint32_t force_ana_0p2a_tieh_sel_1     :    1;
            uint32_t ana_0p2a_dref_0               :    4;
            uint32_t ana_0p2a_dref_1               :    4;
            uint32_t reserved30                    :    2;
        };
        uint32_t val;
    } io_ldo_ctrl1;
    union {
        struct {
            uint32_t ana_0p3a_xpd_0                :    1;
            uint32_t ana_0p3a_xpd_1                :    1;
