Lzw655/esp-bsp/bsp/esp32_p4_function_ev_board/src/mipi_soc/include/lp_sys_struct.h
            uint32_t ana_0p3a_mul_0                :    3;
            uint32_t ana_0p3a_mul_1                :    3;
            uint32_t ana_0p3a_en_vdet_0            :    1;
            uint32_t ana_0p3a_en_vdet_1            :    1;
            uint32_t ana_0p3a_en_cur_lim_0         :    1;
            uint32_t ana_0p3a_en_cur_lim_1         :    1;
            uint32_t ana_0p3a_tieh_sel_0           :    3;
            uint32_t ana_0p3a_tieh_sel_1           :    3;
            uint32_t ana_0p3a_tieh_0               :    1;
            uint32_t ana_0p3a_tieh_1               :    1;
            uint32_t force_ana_0p3a_tieh_sel_0     :    1;
            uint32_t force_ana_0p3a_tieh_sel_1     :    1;
            uint32_t ana_0p3a_dref_0               :    4;
            uint32_t ana_0p3a_dref_1               :    4;
            uint32_t reserved30                    :    2;
        };
        uint32_t val;
    } io_ldo_ctrl2;
    uint32_t reserved_160;
    union {
        struct {
            uint32_t lp_moni_peri0_en              :    1;  /*LP peri0 monitor wakeup enable*/
            uint32_t lp_moni_peri1_en              :    1;  /*LP peri1 monitor wakeup enable*/
            uint32_t lp_moni_clk_switch_en         :    1;  /*LP peri monitor fast clock switch enable*/
            uint32_t reserved3                     :    5;
            uint32_t lp_moni_power_stable_wait_num :    10;  /*wait cycle number for LP peri power stable*/
            uint32_t reserved18                    :    14;
        };
        uint32_t val;
    } lp_moni_ctrl;
    uint32_t lp_moni_slp_wait_num;
    uint32_t lp_moni_work_wait_num;
    union {
        struct {
            uint32_t lpcore_reset_cause            :    6;  /*6'h1: POR reset
6'h2: external reset
6'h6: LP core reset from LP watchdog
6'h9: PMU LP CPU power down reset
6'hf: brown out reset
6'h10: LP watchdog chip reset
6'h12: super watch dog reset
6'h13: glitch reset
6'h14: software reset from HP*/
            uint32_t lpcore_reset_flag             :    1;
            uint32_t lpcore_reset_flag_clr         :    1;
            uint32_t reserved8                     :    24;
        };
        uint32_t val;
    } lp_core_rst_status;
    union {
        struct {
            uint32_t f2s_apb_postw_en              :    1;  /*fast to slow clock apb2apb sync bridge post write enable, post write can speed up write, but will take time to update value to register */
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } f2s_apb_brg_cntl;
    uint32_t reserved_178;
    uint32_t reserved_17c;
    union {
        struct {
            uint32_t sw_hw_usb_phy_sel             :    1;
            uint32_t sw_usb_phy_sel                :    1;
            uint32_t reserved2                     :    30;
        };
        uint32_t val;
    } usb_ctrl;
    union {
        struct {
            uint32_t systimer_target0_intr_en      :    1;  /*systimer target0 intr enable*/
            uint32_t systimer_target1_intr_en      :    1;  /*systimer target1 intr enable*/
            uint32_t systimer_target2_intr_en      :    1;  /*systimer target2 intr enable*/
            uint32_t hp_cpu_intr_sync_en           :    1;  /*hp cpu intr sync enabe*/
            uint32_t adc_intr_en                   :    1;  /* adc intr enable*/
            uint32_t i2c_intr_en                   :    1;  /* i2c intr enable*/
            uint32_t i2s_intr_en                   :    1;  /*i2s intr enable*/
            uint32_t spi_intr_en                   :    1;  /*spi  int enable*/
            uint32_t tsens_intr_en                 :    1;  /*tsens intr enable*/
            uint32_t lp_uart_intr_en               :    1;  /*lp_uart intr enable*/
            uint32_t lp_gpio_intr_en               :    1;  /* lp gpio intr enable*/
            uint32_t mb_lp_intr_en                 :    1;  /*mb_lp intr enable*/
            uint32_t efuse_intr_en                 :    1;  /* efuse intr enable*/
            uint32_t wdt_intr_en                   :    1;  /* wdt intr enable*/
            uint32_t swd_intr_en                   :    1;  /*swd intr enable*/
            uint32_t rtc_tmr_intr_en               :    1;  /* rtc tmr intr enabe*/
            uint32_t lp_i3c_slv_intr_en            :    1;  /* lp_i3c slv intr enable*/
            uint32_t lp_i3c_mst_intr_en            :    1;  /*lp_i3c mst intr enable*/
            uint32_t pmu_intr_en                   :    1;  /*pmu intr enable*/
            uint32_t xtal32k_intr_en               :    1;  /*xtal32k intr enable*/
            uint32_t reserved20                    :    12;
        };
        uint32_t val;
    } lp_int_en;
    union {
        struct {
            uint32_t systimer_target0_intr_st      :    1;  /*systimer target0 intr status*/
            uint32_t systimer_target1_intr_st      :    1;  /*systimer target1 intr status*/
            uint32_t systimer_target2_intr_st      :    1;  /*systimer target2 intr status*/
            uint32_t hp_cpu_intr_sync_st           :    1;  /*hp cpu intr sync status*/
            uint32_t adc_intr_st                   :    1;  /* adc intr status*/
            uint32_t i2c_intr_st                   :    1;  /* i2c intr status*/
            uint32_t i2s_intr_st                   :    1;  /*i2s intr status*/
            uint32_t spi_intr_st                   :    1;  /*spi  int status*/
            uint32_t tsens_intr_st                 :    1;  /*tsens intr status*/
            uint32_t lp_uart_intr_st               :    1;  /*lp_uart intr status*/
            uint32_t lp_gpio_intr_st               :    1;  /* lp gpio intr status*/
            uint32_t mb_lp_intr_st                 :    1;  /*mb_lp intr status*/
            uint32_t efuse_intr_st                 :    1;  /* efuse intr status*/
            uint32_t wdt_intr_st                   :    1;  /* wdt intr status*/
            uint32_t swd_intr_st                   :    1;  /*swd intr status*/
            uint32_t rtc_tmr_intr_st               :    1;  /* rtc tmr intr status*/
            uint32_t lp_i3c_slv_intr_st            :    1;  /* lp_i3c slv intr status*/
            uint32_t lp_i3c_mst_intr_st            :    1;  /*lp_i3c mst intr status*/
            uint32_t pmu_intr_st                   :    1;  /*pmu intr status*/
            uint32_t xtal32k_intr_st               :    1;  /*xtal32k intr status*/
            uint32_t reserved20                    :    12;
        };
        uint32_t val;
    } lp_int_st;
    union {
        struct {
            uint32_t lp_tcm_ram_mem_aux_ctrl       :    14;  /*{ {TEST1} , {RME} , {RM[3:0]} , {RA[1:0]} , {WA[2:0]} , {WPULSE[2:0]} }*/
            uint32_t reserved14                    :    18;
        };
        uint32_t val;
    } lp_tcm_ram_mem_aux_ctrl;
    union {
        struct {
            uint32_t ana_0p1a_target0_0            :    8;  /*set a target value to triger interrupt*/
            uint32_t ana_0p1a_target1_0            :    8;  /*set a target value to triger interrupt*/
            uint32_t ana_0p1a_ldo_cnt_prescaler_sel_0:    1;  /*0: 20MHz prescaler with 16 equals 0.8us 1:20MHz prescaler with 32 equals 1.6us*/
            uint32_t ana_0p1a_xpd_0                :    1;  /* set 1 after set ana_reg_0p1a_xpd_0*/
            uint32_t ana_0p1a_tieh_0_pos_en        :    1;  /* set 1 to enable tieh negedge triger ldo counter*/
            uint32_t ana_0p1a_tieh_0_neg_en        :    1;  /* set 1 to enable tieh posedge triger ldo counter*/
            uint32_t reserved20                    :    12;
        };
        uint32_t val;
    } reg_0p1a_0_cnt_ctrl;
    union {
        struct {
            uint32_t ana_0p1a_target0_1            :    8;  /*set a target value to triger interrupt*/
            uint32_t ana_0p1a_target1_1            :    8;  /*set a target value to triger interrupt*/
            uint32_t ana_0p1a_ldo_cnt_prescaler_sel_1:    1;  /*0: 20MHz prescaler with 16 equals 0.8us 1:20MHz prescaler with 32 equals 1.6us*/
            uint32_t ana_0p1a_xpd_1                :    1;  /* set 1 after set ana_reg_0p1a_xpd_1*/
            uint32_t ana_0p1a_tieh_1_pos_en        :    1;  /* set 1 to enable tieh negedge triger ldo counter*/
            uint32_t ana_0p1a_tieh_1_neg_en        :    1;  /* set 1 to enable tieh posedge triger ldo counter*/
            uint32_t reserved20                    :    12;
        };
        uint32_t val;
    } reg_0p1a_1_cnt_ctrl;
    union {
        struct {
            uint32_t ana_0p2a_target0_0            :    8;  /*set a target value to triger interrupt*/
            uint32_t ana_0p2a_target1_0            :    8;  /*set a target value to triger interrupt*/
            uint32_t ana_0p2a_ldo_cnt_prescaler_sel_0:    1;  /*0: 20MHz prescaler with 16 equals 0.8us 1:20MHz prescaler with 32 equals 1.6us*/
            uint32_t ana_0p2a_xpd_0                :    1;  /* set 1 after set ana_reg_0p2a_xpd_0*/
            uint32_t ana_0p2a_tieh_0_pos_en        :    1;  /* set 1 to enable tieh negedge triger ldo counter*/
            uint32_t ana_0p2a_tieh_0_neg_en        :    1;  /* set 1 to enable tieh posedge triger ldo counter*/
            uint32_t reserved20                    :    12;
        };
        uint32_t val;
    } reg_0p2a_0_cnt_ctrl;
    union {
        struct {
            uint32_t ana_0p2a_target0_1            :    8;  /*set a target value to triger interrupt*/
            uint32_t ana_0p2a_target1_1            :    8;  /*set a target value to triger interrupt*/
            uint32_t ana_0p2a_ldo_cnt_prescaler_sel_1:    1;  /*0: 20MHz prescaler with 16 equals 0.8us 1:20MHz prescaler with 32 equals 1.6us*/
            uint32_t ana_0p2a_xpd_1                :    1;  /* set 1 after set ana_reg_0p2a_xpd_1*/
            uint32_t ana_0p2a_tieh_1_pos_en        :    1;  /* set 1 to enable tieh negedge triger ldo counter*/
            uint32_t ana_0p2a_tieh_1_neg_en        :    1;  /* set 1 to enable tieh posedge triger ldo counter*/
            uint32_t reserved20                    :    12;
        };
        uint32_t val;
    } reg_0p2a_1_cnt_ctrl;
    union {
        struct {
            uint32_t ana_0p3a_target0_0            :    8;  /*set a target value to triger interrupt*/
            uint32_t ana_0p3a_target1_0            :    8;  /*set a target value to triger interrupt*/
            uint32_t ana_0p3a_ldo_cnt_prescaler_sel_0:    1;  /*0: 20MHz prescaler with 16 equals 0.8us 1:20MHz prescaler with 32 equals 1.6us*/
            uint32_t ana_0p3a_xpd_0                :    1;  /* set 1 after set ana_reg_0p3a_xpd_0*/
            uint32_t ana_0p3a_tieh_0_pos_en        :    1;  /* set 1 to enable tieh negedge triger ldo counter*/
            uint32_t ana_0p3a_tieh_0_neg_en        :    1;  /* set 1 to enable tieh posedge triger ldo counter*/
            uint32_t reserved20                    :    12;
        };
        uint32_t val;
    } reg_0p3a_0_cnt_ctrl;
    union {
        struct {
            uint32_t ana_0p3a_target0_1            :    8;  /*set a target value to triger interrupt*/
            uint32_t ana_0p3a_target1_1            :    8;  /*set a target value to triger interrupt*/
            uint32_t ana_0p3a_ldo_cnt_prescaler_sel_1:    1;  /*0: 20MHz prescaler with 16 equals 0.8us 1:20MHz prescaler with 32 equals 1.6us*/
            uint32_t ana_0p3a_xpd_1                :    1;  /* set 1 after set ana_reg_0p3a_xpd_1*/
            uint32_t ana_0p3a_tieh_1_pos_en        :    1;  /* set 1 to enable tieh negedge triger ldo counter*/
            uint32_t ana_0p3a_tieh_1_neg_en        :    1;  /* set 1 to enable tieh posedge triger ldo counter*/
            uint32_t reserved20                    :    12;
        };
        uint32_t val;
    } reg_0p3a_1_cnt_ctrl;
    union {
        struct {
            uint32_t sdio_slave_ldo_ready          :    1;  /*Set 1 to tell sdio slave that ldo is ready*/
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } sdio_slave_ldo_ready;
    union {
        struct {
            uint32_t ana_xpd_pad_group             :    8;  /*Set 1 to power up pad group*/
            uint32_t ana_sdio_pll_xpd              :    1;  /*Set 1 to power up sdio pll*/
            uint32_t ana_mspi_phy_xpd              :    1;  /*Set 1 to power up mspi dqs phy*/
            uint32_t reserved10                    :    22;
        };
        uint32_t val;
    } ana_xpd_pad_group;
    union {
        struct {
            uint32_t lp_tcm_ram_rdn_eco_en         :    1;
            uint32_t lp_tcm_ram_rdn_eco_result     :    1;
            uint32_t reserved2                     :    30;
        };
        uint32_t val;
    } lp_tcm_ram_rdn_eco_cs;
    uint32_t lp_tcm_ram_rdn_eco_low;
    uint32_t lp_tcm_ram_rdn_eco_high;
    union {
        struct {
            uint32_t lp_tcm_rom_rdn_eco_en         :    1;
            uint32_t lp_tcm_rom_rdn_eco_result     :    1;
            uint32_t reserved2                     :    30;
        };
        uint32_t val;
    } lp_tcm_rom_rdn_eco_cs;
    uint32_t lp_tcm_rom_rdn_eco_low;
    uint32_t lp_tcm_rom_rdn_eco_high;
    uint32_t reserved_1c8;
    uint32_t reserved_1cc;
    union {
        struct {
            uint32_t dcdc_on_req                   :    1;  /*SW trigger dcdc on*/
            uint32_t dcdc_off_req                  :    1;  /*SW trigger dcdc off*/
            uint32_t dcdc_lightslp_req             :    1;  /*SW trigger dcdc enter lightsleep*/
            uint32_t dcdc_deepslp_req              :    1;  /*SW trigger dcdc enter deepsleep*/
            uint32_t reserved4                     :    4;
            uint32_t dcdc_on_force_pu              :    1;
            uint32_t dcdc_on_force_pd              :    1;
            uint32_t dcdc_fb_res_force_pu          :    1;
            uint32_t dcdc_fb_res_force_pd          :    1;
            uint32_t dcdc_ls_force_pu              :    1;
            uint32_t dcdc_ls_force_pd              :    1;
            uint32_t dcdc_ds_force_pu              :    1;
            uint32_t dcdc_ds_force_pd              :    1;
            uint32_t dcm_cur_st                    :    8;
            uint32_t ana_dcdc_vset                 :    5;
            uint32_t ana_dcdc_en_amux_test         :    1;  /*Enable analog mux to pull PAD TEST_DCDC voltage signal*/
            uint32_t reserved30                    :    2;
        };
        uint32_t val;
    } lp_dcm_ctrl;
    union {
        struct {
            uint32_t dcdc_pre_delay                :    8;  /*DCDC pre-on/post off delay*/
            uint32_t dcdc_res_off_delay            :    8;  /*DCDC fb res off delay*/
            uint32_t dcdc_stable_delay             :    10;  /*DCDC stable delay*/
            uint32_t reserved26                    :    6;
        };
        uint32_t val;
    } lp_dcm_wait_delay;
    union {
        struct {
            uint32_t dcm_gpio_drv                  :    4;  /* DCDC GPIO 1/2 drv, bit0 for gpio1, bit1 for gpio2*/
            uint32_t dcm_gpio_hold                 :    2;  /*DCDC GPIO 1/2 hold*/
            uint32_t dcm_gpio_rde                  :    2;  /*DCDC GPIO 1/2 rde*/
            uint32_t dcm_gpio_rue                  :    2;  /*DCDC GPIO 1/2 rue*/
            uint32_t reserved10                    :    22;
        };
        uint32_t val;
    } lp_dcdc_pad_ctrl;
    union {
        struct {
            uint32_t sdio_in_force                 :    1;  /*force to contrl sdio_in sample edge using register*/
            uint32_t sdio_out_force                :    1;  /*0-negedge sample 1-posedge sample*/
            uint32_t sdio_in_ctrl                  :    1;  /*force to contrl sdio_out sample edge using register*/
            uint32_t sdio_out_ctrl                 :    1;  /*0-negedge sample 1-posedge sample*/
            uint32_t reserved4                     :    28;
        };
        uint32_t val;
    } sdio_slave_ctrl;
    union {
        struct {
            uint32_t pmu_rdn_eco_en                :    1;
            uint32_t pmu_rdn_eco_result            :    1;
            uint32_t reserved2                     :    30;
        };
        uint32_t val;
    } lp_pmu_rdn_eco_cs;
    uint32_t lp_pmu_rdn_eco_low;
    uint32_t lp_pmu_rdn_eco_high;
} lp_sys_dev_t;
extern lp_sys_dev_t LP_SYS;
#ifdef __cplusplus
}
#endif



#endif /*_SOC_LP_SYS_STRUCT_H_ */
